Repository: 84000/data-translation-memory
Catalog: toh62-v3.tmx
Source language: bo
Languages: en

source: །ཆོས་ཀྱི་རྒྱལ་པོ་ནོར་བདུན་སྦྱིན་པ་པོ།
en: “King of the Dharma, bestower of the seven riches,

source: །ཆོས་ཀྱི་སྦྱིན་བདག་དུལ་བའི་ཐུགས་མངའ་བ།
en: Benefactor of the Dharma, having a tamed mind,

source: །ཆོས་ཀྱི་སྤྱད་པས་འགྲོ་བ་རྗེས་སྟོན་པ།
en: You teach beings through your Dharmic conduct.

source: །འདྲེན་པ་ཆོས་ཀྱི་རྗེ་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to the guide, master of the Dharma. “Your armor of loving kindness, your supreme sword of mindfulness,

source: །བྱམས་པའི་གོ་ཆ་དྲན་པའི་རལ་གྲི་མཆོག །ཚུལ་ཁྲིམས་གཞུ་དང་ཤེས་རབ་ཐབས་ཀྱི་མངའ། །དེ་ཡིས་སྐྱེ་འཆི་སྲིད་སྲེད་འཕེལ་བགྱིད་པ།
en: Your bow of discipline, and your arrows of insight and skillful means

source: །ཉོན་མོངས་དགྲ་དག་རྣམ་པར་བཅོམ་པར་འགྱུར།
en: Completely destroy the enemies— Afflictions that increase the craving for birth, death, and existence.

source: །རྒལ་ནས་སེམས་ཅན་ཁྲག་ཁྲིག་རྣམས་ཀྱང་སྒྲོལ།
en: “Having gone beyond, you liberate myriad beings;

source: །གྲོལ་ནས་འཆིང་བ་ལས་ནི་འགྲོ་བ་འགྲེལ། །བདེ་གཤེགས་གང་གི་ཞི་བའི་གནས་མཆི་བ།
en: Being liberated, you liberate the world from its chains.

source: །བདེ་བ་རིམས་ནད་མ་མཆིས་ལམ་ཡང་སྟོན།
en: You also show the path that is delightful and without sickness, And on which the sugatas go to a state of peace. “Out of compassion, you teach This unconditioned peaceful supreme state,

source: །གང་ན་སྐྱེ་དང་འཆི་བ་མ་མཆིས་ཤིང་།
en: In which there is neither birth nor death,

source: །འབྲལ་བའི་སྡུག་བསྔལ་འབྱུང་བར་མི་འགྱུར་བ།
en: Nor the occurrence of suffering from deprivation.

source: །གནས་མཆོག་ཞི་བ་འདུས་མ་བགྱིས་པ་དེ།
en: “May beings become completely enlightened through the merit

source: །ཐུགས་རྗེས་བརྙེས་ནས་ཁྱོད་ཀྱིས་བསྟན་པ་མཛད།
en: I have gathered by praising the Victorious One,

source: །ཆོས་ཀུན་དབང་གི་ཕ་རོལ་གཤེགས་པའི་རྒྱལ།
en: Who has crossed over to the other side through having mastered all phenomena,

source: །ཐུབ་པ་ཆེན་པོ་འཇིག་རྟེན་མཆོག་བསྟོད་པས། །བདག་གིས་འདིར་ནི་བསོད་ནམས་གང་བསགས་དེས།
en: Who is the great sage, the supreme one in this world.”

source: །འགྲོ་བ་བྱང་ཆུབ་མངོན་པར་འཚང་རྒྱ་ཤོག །དེ་ནས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གིས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གི་མངོན་པར་བསྟོད་ནས་ཐལ་མོ་སྦྱར་ཏེ་སྟན་ལས་ལངས་ནས་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ཏེ་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས།
en: Then, having praised the Bhagavān with these verses, the venerable Rāṣṭrapāla joined his palms. Rising from his seat, he draped his upper garment over one shoulder and placed his right knee on the ground.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །གལ་ཏེ་ཞུས་ནས་ཞུ་བ་ལུང་བསྟན་པའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱི་བདག་ལ་སྐབས་ཕྱེ་ན། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་བདག་ཕྱོགས་འགའ་ཞིག་ཞུ་ལགས་སོ།
en: He then bowed toward the Bhagavān with joined hands and made a request to the Bhagavān, “If you, Bhagavān, allowed me the opportunity to approach you with a question, I would like to ask you, the bhagavān, the tathāgata, the arhat, the perfect and complete Buddha, about certain issues.”

source: །དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཡུལ་འཁོར་སྐྱོང་ཁྱོད་ཅི་དང་ཅི་འདོད་པ་དྲིས་ཤིག་དང་། ངས་དྲིས་པ་དེ་དང་དེ་ཉིད་ཀྱི་ལུང་བསྟན་པས་ཁྱོད་ཀྱི་སེམས་རངས་པར་བྱའོ།
en: Having thus been petitioned, the Bhagavān said to the venerable Rāṣṭrapāla, “Rāṣṭrapāla, ask whatever you like! I will please your mind by clarifying whatever questions you may have.”

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་དུ་དང་ལྡན་ན་ཆོས་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་གྱི་ཁྱད་པར་ཐོབ་པར་འགྱུར། གཞན་ལ་རག་མ་ལས་པའི་ཤེས་པ་འཐོབ། མྱུར་བའི་ཤེས་རབ་འཐོབ། སྤོབས་པ་རྣམ་པར་ངེས་པ་འཐོབ། སྣང་བ་འཐོབ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་འཇུག་པ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བགྱིད་པ་དང་། ཡིད་གཉིས་སྤོང་བ་དང་། སོམ་ཉི་སྤོང་བ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་རྣམ་པར་ངེས་པ་འཐོབ། སེམས་ཅན་འཛུད་པ་ལ་མཁས་པ་དང་། ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་དུ་བགྱིད་པ་དང་། ལྡེམ་པོ་དག་ཡང་དག་པ་དང་། སེམས་ཅན་གྱི་ཁམས་ལ་མཁས་པ་དང་། སངས་རྒྱས་རྗེས་སུ་དྲན་པ་འཐོབ་པ་དང་། ཞུ་བ་ཐམས་ཅད་ཞུ་བ་དང་། ཆོས་ཐམས་ཅད་འཛིན་པ་དང་། མྱུར་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་འཐོབ་པར་འགྱུར།
en: Having said these words, the venerable Rāṣṭrapāla asked the Bhagavān, “Bhagavān, how many qualities has a bodhisattva mahāsattva—one who obtains the excellence of all qualities and virtues, who obtains knowledge not depending on others, who gains swift insight, who obtains the ascertainment of eloquence, who obtains illumination, who realizes omniscience, who causes beings to ripen, who eliminates doubt, who eliminates desire, who obtains the ascertainment of omniscience, who is skillful in guiding beings, who acts as he speaks, whose speech is based on genuine intentions, who is skillful in dealing with all sentient beings, who attains the recollection of the Buddha, who asks all questions, who retains all Dharma teachings, and who swiftly obtains omniscience?”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསོལ་ཏོ།
en: Then the venerable Rāṣṭrapāla uttered the following verses:

source: །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རབ་ངེས་པ།
en: “May the supreme one among men, the Victorious One,

source: །ཡང་དག་ཉིད་དུ་ཇི་ལྟར་དེ་འབྱུང་དང་། །ཡེ་ཤེས་རྒྱ་མཚོའི་བཀའ་མཆིད་རྣམ་ངེས་པ།
en: Give me a precise discourse, an ocean of wisdom, On how to properly ascertain

source: །མི་མཆོག་རྒྱལ་བས་བདག་ལ་བཤད་དུ་གསོལ།
en: The conduct of a bodhisattva, which arises from truth.

source: །ཤིན་ཏུ་སྦྱངས་པའི་གསེར་གྱི་གཟུགས་ལྟ་བུ།
en: “You are like a body of perfectly pure gold.

source: །སེམས་ཅན་དམ་པ་བསོད་ནམས་མཆོག་བསགས་པ།
en: You are an excellent being who has accumulated supreme merit.

source: །ཁྱོད་ནི་སྐྱབས་དང་གནས་དང་དཔུང་གཉེན་ལགས།
en: You are the refuge, the place of rest, and the protector—

source: །བྱང་ཆུབ་སྤྱོད་མཆོག་དྲི་མེད་དེང་བདག་གསུངས།
en: Explain to me today the stainless, supreme conduct of a bodhisattva. “How does one obtain the inexhaustible wisdom,

source: །གཟུངས་དང་བདུད་རྩི་བྱང་ཆུབ་འབྱུང་བ་ཡི།
en: The source of retention, of immortality, and of enlightenment?

source: །ཡེ་ཤེས་མི་ཟད་ཇི་ལྟར་འཐོབ་པར་འགྱུར།
en: How is the ocean of insight purified,

source: །གང་གིས་སྐྱེ་བོའི་དོགས་པ་གཅོད་འགྱུར་བ།
en: By which means you eradicate people’s doubts?

source: །ཤེས་རབ་རྒྱ་མཚོ་ཇི་ལྟར་རྣམ་པར་དག །འཁོར་བར་བསྐལ་བ་བྱེ་བ་མང་པོར་ནི།
en: “While wandering in saṃsāra for many millions of eons, You never grew discouraged—

source: །འཇིག་རྟེན་སྡུག་བསྔལ་ཉེན་ལ་ལྟ་བགྱིད་ཀྱང་། །སྐྱོ་བའི་བློ་ནི་ནམ་ཡང་མི་སྐྱེད་ཅིང་།
en: Even when looking at the world, troubled by sufferings—

source: །དེ་དག་དོན་དགེ་སྟོན་པར་འགྱུར་བ་དང་། །དག་པའི་ཞིང་དང་ཕུན་སུམ་ཚོགས་འཁོར་དང་། །ཚེ་མཆོག་དང་ནི་ཕུན་སུམ་ཚོགས་ཞིང་དང་། །སེམས་ཅན་ཆེད་ཀྱི་བཀའ་མཆིད་བླ་མེད་དང་། །བྱང་ཆུབ་སྤྱོད་པ་དྲི་མེད་བཤད་དུ་གསོལ།
en: And performed virtue for its sake. “Please explain the pure buddhafield, the excellent retinue, The supreme lifespan, the excellent field itself, The unsurpassed discourse for the benefit of sentient beings, And the stainless conduct of a bodhisattva.

source: །བདུད་འཇོམས་མཛད་པ་ལྟ་ངན་སྦྱོང་བ་བོ།
en: “You, one who conquers Māra , who purifies wrong views,

source: །སྲེད་པ་སྐེམས་པ་རྣམ་གྲོལ་རེག་མཛད་པས།
en: Who dries up craving, who causes the attainment of liberation, Jewel among sentient beings, please teach the supreme conduct,

source: །ཆོས་ཀྱི་ཚུལ་ཡང་བསྐྱུད་པར་མི་འགྱུར་བར། །སེམས་ཅན་རིན་ཆེན་སྤྱོད་མཆོག་བསྟན་དུ་གསོལ།
en: So that the way of the Dharma will not be forgotten.

source: །གཟུགས་དང་ལོངས་སྤྱོད་སྤོབས་པ་ཕུན་སུམ་ཚོགས།
en: “You, one who is endowed with excellent appearance, wealth, and eloquence,

source: །སྣུམ་པའི་གསུང་གིས་འཁོར་རྣམས་ཚིམ་མཛད་པ།
en: Who satisfies the assembly with a gentle voice,

source: །བདེ་གཤེགས་སྤྲིན་ལྟར་འགྲོ་བ་ཚིམ་མཛད་པ།
en: And who satisfies the world like a rain cloud—

source: །སངས་རྒྱས་སྤྱོད་ཡུལ་ལེགས་པར་བསྟན་དུ་གསོལ།
en: O Sugata, thoroughly reveal the experiential sphere of buddhas.

source: །ཀ་ལ་པིང་ཀའི་སྒྲ་སྙན་གསུང་འབྱིན་པ།
en: “You, one who speaks with a pleasant voice like that of the kalaviṅka bird,

source: །ཚངས་པའི་དབྱངས་ཀྱིས་བློ་ངན་རབ་འཇིག་པ།
en: Who—with a melodious Brahmā voice—destroys vile thoughts,

source: །ཆོས་འཚལ་གྱུར་པའི་འཁོར་རྣམས་ལྷགས་ལགས་ཀྱིས།
en: As this Dharma-seeking assembly has gathered,

source: །གཙོ་བོ་བདུད་རྩིའི་རོ་ཡིས་ཚིམ་པར་མཛོད།
en: O Lord, satiate us with the taste of the ambrosia.

source: །བྱང་ཆུབ་དམ་པ་མཆོག་ལ་འདུན་པ་མཆིས།
en: “I long for supreme, excellent enlightenment,

source: །ཆོས་ལ་འདུན་པ་བཟློག་པ་མི་རིགས་ཏེ།
en: And it is inappropriate to turn away those longing for the Dharma.

source: །འདྲེན་པ་བསྟན་པ་མཛད་པའི་དུས་འདི་ལགས།
en: Now is the time for teaching, O guide;

source: །རིན་ཆེན་དམ་པ་བསྒྲག་པའི་དུས་ལ་བབ།
en: The time has come to proclaim, O excellent jewel.

source: །ཐུབ་པ་བདག་ནི་བྱང་ཆུབ་རེ་བ་མཆིས།
en: “I hope for enlightenment, O Sage!

source: །བདག་གི་བསམ་པ་རྒྱལ་བས་རབ་ཏུ་མཁྱེན།
en: The Victorious One truly understands my intentions.

source: །རྒྱལ་བ་ཅོ་འདྲི་མ་ལགས་དོན་དུ་གཉེར།
en: I am not deceiving the Victorious One; I am genuinely interested!

source: །སྤྱོད་པ་དམ་པ་ལེགས་པར་བཤད་དུ་གསོལ།
en: Please explain the genuine conduct.”

source: །དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: Having thus been petitioned, the Bhagavān said the following to the venerable Rāṣṭrapāla:

source: །ཡུལ་འཁོར་སྐྱོང་ཁྱོད་ལེགས་སོ།
en: “You are right, Rāṣṭrapāla!

source: །ཡུལ་འཁོར་སྐྱོང་ཁྱོད་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པའི་ཕྱིར་ཞུགས་པ་དང་། ཡུལ་འཁོར་སྐྱོང་ཁྱོད་སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། ལྷ་དང་མི་རྣམས་ཀྱི་དོན་དང་། ཕན་པ་དང་། ད་ལྟར་དང་། མ་འོངས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ལ་དོན་འདི་འདྲི་བར་སེམས་པ་ནི་ལེགས་སོ།
en: You, Rāṣṭrapāla, have gone forth for the benefit of many living beings. And it is good that you, Rāṣṭrapāla, have well considered this topic you queried Tathāgata about, for the happiness of many people, for the sake and benefit of gods and men, and so that I will take care of the bodhisattva mahāsattvas present and future.

source: །ཡུལ་འཁོར་སྐྱོང་ཁྱོད་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་ངས་ཁྱོད་ལ་བཤད་དོ།
en: Therefore, Rāṣṭrapāla, listen closely and keep it in your mind!

source: །བཅོམ་ལྡན་འདས་ལེགས་སོ་ཞེས་གསོལ་ཏེ། །ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: I will explain it to you.” The venerable Rāṣṭrapāla answered, “Very well, Bhagavān!” and as he listened carefully to each of the Bhagavān’s words, the Bhagavān uttered the following words to him:

source: །ཡུལ་འཁོར་སྐྱོང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་བཞི་དང་ལྡན་ན་ཡོངས་སུ་དག་པ་འདི་དག་འཐོབ་བོ།
en: “Rāṣṭrapāla, a bodhisattva mahāsattva endowed with four qualities attains the following types of purity.

source: །བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are these four?

source: བསམ་པ་དང་ལྷག་པའི་བསམ་པས་ནན་ཏན་བྱེད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་མཉམ་པ་དང་། སྟོང་པ་ཉིད་སྒོམ་པ་དང་། ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་བྱེད་པ་སྟེ་ཡུལ་འཁོར་སྐྱོང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་ཡོངས་སུ་དག་པ་འདི་དག་འཐོབ་བོ།
en: They are making efforts in accordance with beings’ aspirations and highest intent, being impartial toward all sentient beings, meditating on emptiness, and acting just as one speaks. Rāṣṭrapāla, if bodhisattva mahāsattvas are endowed with these four qualities, they will attain purity.

source: །འདི་ལ་འདི་ནི་ཆོས་ཉིད་ཡིན་ཏེ།
en: This is how it is.

source: དེ་ལ་འདི་སྐད་ཅེས་བྱའོ།
en: In this regard, the following is said: “Those endowed with infinite wisdom

source: །བསམ་པ་ཐག་པས་རྟག་ཏུ་མངོན་བརྩོན་པ།
en: Always possess diligence out of sincere intentions.

source: །བྱང་ཆུབ་ལམ་ལས་མི་ལྡོག་ཡིད་ལྡན་པ།
en: Having a mind that does not turn away from the path to enlightenment,

source: །གཡོ་མེད་ཐ་བ་མེད་ཅིང་སྒྱུ་མེད་པ།
en: They are neither deceitful, nor rigid, nor deceptive.

source: །ཡེ་ཤེས་མཐའ་ཡས་ལྡན་ལ་དེ་དག་ཡོད།
en: “Seeing the suffering of beings without a protector,

source: །སྐྱེ་དང་ན་དང་རྒ་དང་འཆིས་གཟིར་བ། །སེམས་ཅན་མགོན་མེད་སྡུག་བསྔལ་མཐོང་ནས་ནི།
en: Afflicted by birth, sickness, old age, and death, They excellently prepare a Dharma boat

source: །སྲིད་པའི་མཚོ་ལས་འགྲོ་བ་སྒྲོལ་བའི་ཕྱིར། །དེ་དག་ཆོས་ཀྱི་གྲུ་ནི་ཡང་དག་སྦྱོར།
en: To rescue sentient beings from the ocean of existence.

source: །དེས་པ་སེམས་ཅན་ཀུན་ལ་སེམས་མཉམ་པ།
en: “Gentle ones with equanimity toward all sentient beings

source: །བུ་གཅིག་པ་བཞིན་འགྲོ་བ་རྣམས་ལ་ལྟ།
en: Look at beings as if they were their only son;

source: །འདི་དག་ཐམས་ཅད་བདག་གིས་དགྲོལ་ལོ་ཞེས།
en: ‘I will free all of them’—

source: །གང་ཟག་མཆོག་གི་བསམ་པ་དེ་འདྲའོ།
en: Such is the intention of supreme persons.

source: །སྟོང་ཉིད་རྟག་ཏུ་རྟོགས་པར་ཁོང་དུ་ཆུད།
en: “They always perfectly understand emptiness,

source: །བདག་ཡོད་མ་ཡིན་སེམས་ཅན་ཡོད་མ་ཡིན།
en: That there is neither self nor sentient being,

source: །འདུས་བྱས་སྒྱུ་མ་རྨི་ལམ་འདྲ་བ་ལ།
en: And that the conditioned is like an illusion or a dream.

source: །བྱིས་པ་མི་མཁས་འདི་ལ་རྣམ་པར་རྨོངས།
en: The childish, not being skilled, are confused about these things.

source: །མཁས་པ་དེ་དག་ཇི་སྐད་ཚིག་སྨྲས་པ།
en: “The skilled ones strive,

source: །དེ་ལ་ནན་ཏན་བྱེད་ཅིང་ཀུན་ཏུ་གནས།
en: And fully abide by what they say.

source: །དུལ་ཞིང་ཞི་ལ་རྟག་ཏུ་སྐྱོན་རྣམས་སྤངས།
en: The sons of the victorious ones are always tamed, peaceful, without faults,

source: །རྒྱལ་བའི་སྲས་རྣམས་བྱང་ཆུབ་ལམ་ལ་དགའ།
en: And delighted in the path to enlightenment.

source: །ཡུལ་འཁོར་སྐྱོང་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དབུགས་འབྱིན་པ་འཐོབ་པ་སྟེ།
en: “Rāṣṭrapāla, there are four reassurances for bodhisattvas.

source: བཞི་གང་ཞེ་ན།
en: What are these four?

source: གཟུངས་ཐོབ་པ་དང་། དགེ་བའི་བཤེས་གཉེན་རྙེད་པ་དང་། །ཆོས་ཟབ་མོ་ལ་བཟོད་པ་ཐོབ་པ་དང་། ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པ་ཡང་དག་པར་སྤྱོད་པ་སྟེ།
en: They are attaining retention, finding a spiritual friend, being receptive to the profound Dharma, and the correct application of completely pure discipline.

source: ཡུལ་འཁོར་སྐྱོང་བཞི་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དབུགས་འབྱིན་པ་འཐོབ་པའོ།
en: Raṣṭrapāla, these four are the reassurances for bodhisattvas.

source: །གང་གིས་སངས་རྒྱས་ཀུན་གྱིས་གསུངས་པའི་ཆོས་མཆོག་འཛིན་འགྱུར་བ། །གཟུངས་རྣམས་གྲགས་པ་ཆེན་པོ་དེ་དག་གིས་ནི་རྟག་ཏུ་ཐོབ།
en: By which they behold the supreme Dharma that all buddhas have proclaimed.

source: །ནམ་ཡང་ཆུད་ཟར་མི་འགྱུར་ཕྱིར་ཞིང་བློ་གྲོས་རབ་ཏུ་འཕེལ།
en: Because they never lose it, their intellect increases.

source: །དེ་དག་ཡེ་ཤེས་ཆགས་པ་མེད་ཅིང་ཆོས་ཀུན་ཕ་རོལ་ཕྱིན།
en: They possess wisdom, lack attachment, and have mastered all qualities.

source: །བྱང་ཆུབ་ཡན་ལག་འཕེལ་བར་བྱེད་པའི་དགེ་བའི་བཤེས་གཉེན་རྙེད།
en: “They have found a spiritual friend who causes the branches of enlightenment to grow.

source: །དེ་དག་འདྲེན་པ་རྣམས་ནི་གང་ནས་བཞུད་པའི་ལམ་མཆོག་སྟོན།
en: The guides show them the supreme path for progress.

source: །དེ་དག་སྡིག་པའི་གྲོགས་པོ་དག་ལ་སྟེན་པ་མ་ཡིན་ཏེ།
en: They do not attend to nefarious friends

source: །ཚིག་བྱེད་བདག་ཉིད་མེ་ལྟར་དེ་དག་རིང་དུ་རྣམ་པར་སྤོང་།
en: But turn far away from them like from a scorching fire.

source: །དཔའ་བོ་སྟོང་པ་ཉིད་དང་ལྡན་པའི་ཟབ་མོའི་ཆོས་ཐོས་ནས།
en: “Once the heroes have heard the profound teaching on emptiness,

source: །དེ་དག་བདག་དང་སེམས་ཅན་སྲོག་ཏུ་ལྟ་བ་ཀུན་མི་འབྱུང་།
en: They never generate any view of a self, a sentient being, or a life force.

source: །དེ་དག་ཚུལ་ཁྲིམས་སྐྱོན་མེད་དུལ་ཞིང་ཞི་བའི་ཡིད་དང་ལྡན།
en: Their discipline is faultless, and they are endowed with a tame and peaceful mind.

source: །སངས་རྒྱས་ཚུལ་ཁྲིམས་བླ་ན་མེད་ལ་སེམས་ཅན་རྣམས་ཀྱང་སྦྱོར།
en: Living beings are encouraged to take up the unsurpassable discipline of the Buddha as well.

source: །ཡུལ་འཁོར་སྐྱོང་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་འཁོར་བ་ན་འཁོད་པ་རྣམས་དགའ་བར་བྱེད་པའི་ཆོས་ཏེ།
en: “Rāṣṭrapāla, these four are the qualities that cause delight in the bodhisattvas dwelling in saṃsāra.

source: ཡུལ་འཁོར་སྐྱོང་སངས་རྒྱས་མཐོང་བ་བྱང་ཆུབ་སེམས་དཔའ་འཁོར་བ་ན་འཁོད་པ་རྣམས་དགའ་བར་བྱེད་པའི་ཆོས་དང་། ཡུལ་འཁོར་སྐྱོང་རྗེས་སུ་འཐུན་པའི་ཆོས་ཐོས་པ་བྱང་ཆུབ་སེམས་དཔའ་འཁོར་བ་ན་འཁོད་པ་རྣམས་དགའ་བར་བྱེད་པའི་ཆོས་དང་། ཡུལ་འཁོར་སྐྱོང་བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་བྱང་ཆུབ་སེམས་དཔའ་འཁོར་བ་ན་འཁོད་པ་རྣམས་དགའ་བར་བྱེད་པའི་ཆོས་དང་། ཡུལ་འཁོར་སྐྱོང་དམིགས་སུ་མེད་པའི་ཆོས་ལ་བཟོད་པ་བྱང་ཆུབ་སེམས་དཔའ་འཁོར་བ་ན་འཁོད་པ་རྣམས་དགའ་བར་བྱེད་པའི་ཆོས་ཏེ།
en: Rāṣṭrapāla, seeing the Buddha is a quality that causes delight in the bodhisattvas dwelling in saṃsāra. Rāṣṭrapāla, hearing appropriate instructions is a quality that causes delight in the bodhisattvas dwelling in saṃsāra. Rāṣṭrapāla, complete abandonment of possessions is a quality that causes delight in the bodhisattvas dwelling in saṃsāra, and, Rāṣṭrapāla, being receptive to the Dharma of non-apprehension is a quality that causes delight in the bodhisattvas dwelling in saṃsāra.

source: ཡུལ་འཁོར་སྐྱོང་བཞི་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་འཁོར་བ་ན་འཁོད་པ་རྣམས་དགའ་བར་བྱེད་པའི་ཆོས་སོ།
en: Rāṣṭrapāla, these four are things that cause delight in the bodhisattvas dwelling in saṃsāra.

source: །གཟི་བརྗིད་ཀྱིས་ནི་འཇིག་རྟེན་ཐམས་ཅད་ཀུན་ནས་སྣང་མཛད་པའི།
en: “In every lifetime, they see the perfect buddhas, the supreme ones among men,

source: །རྫོགས་པའི་སངས་རྒྱས་མི་མཆོག་ཚེ་རབས་ཀུན་དུ་དེ་དག་མཐོང་།
en: Who fully illuminate the whole world with their splendor.

source: །བྱང་ཆུབ་དམ་པ་མཆོག་ཚོལ་ཚེ་ན་སེམས་ཅན་དགྲོལ་བའི་ཕྱིར།
en: When seeking supreme, excellent enlightenment for the sake of liberating beings,

source: དགའ་ཞིང་གུས་པར་གནས་ནས་དེ་ལྟར་མི་དབང་རྒྱལ་པོ་མཆོད།
en: They abide in delight and devotion; thus, they worship the lord of men, the Victorious One.

source: །འདྲེན་པ་རྣམས་ལས་ཞི་བ་རྗེས་སུ་འཐུན་པའི་ཆོས་ཀྱང་ཉན།
en: “They listen to the peaceful and harmonious Dharma from the guides.

source: །ཐོས་ནས་བསམ་པ་ཐག་པས་བརྟན་པ་ཚུལ་བཞིན་རབ་ཏུ་སྦྱོར།
en: Having heard it, they practice it with firm intention, steadily and properly.

source: །དམིགས་མེད་ཆོས་ཐོས་ཆོས་འདི་ཐམས་ཅད་སེམས་ཅན་མེད་པ་དང་། །འདི་ལ་བདག་མེད་པར་ནི་ཆོས་ལ་སོམ་ཉི་དེ་མི་སྐྱེད།
en: Hearing the Dharma of non-apprehension , no doubt arises about the fact That all things are without existence and lack a self.

source: །དེ་ནི་བདོག་པ་ཐམས་ཅད་ཡོངས་གཏོང་རྟག་ཏུ་ཀུན་འཛིན་མེད།
en: “They fully renounce all their possessions and acquire nothing.

source: །སློང་བ་ཉེ་བར་འོངས་པ་མཐོང་ན་སེམས་ནི་རབ་ཏུ་དགའ།
en: Conscious of having become beggars, their minds are very pleased.

source: །གྲོང་དང་ཡུལ་འཁོར་ས་དང་སྲོག་དང་བུ་དང་ཆུང་མ་དང་། །ཐམས་ཅད་གཏོང་ཞིང་དེ་ཡི་སེམས་ནི་གང་དུའང་གཡོ་བ་མེད།
en: They renounce everything—villages, kingdoms , lands, lives, children, and wives— And their minds never waver.

source: །ཡུལ་འཁོར་སྐྱོང་བྱང་ཆུབ་སེམས་དཔས་ཆོས་བཞི་ལ་བལྟ་བར་མི་བྱ་སྟེ།
en: “Rāṣṭrapāla, bodhisattvas should have no concern for four things.

source: བཞི་གང་ཞེ་ན་ཡུལ་འཁོར་སྐྱོང་བྱང་ཆུབ་སེམས་དཔས་ཁྱིམ་གྱི་གནས་ལ་བལྟ་བར་མི་བྱ་བ་དང་། ཡུལ་འཁོར་སྐྱོང་བྱང་ཆུབ་སེམས་དཔས་རབ་ཏུ་བྱུང་ནས་རྙེད་པ་དང་། བཀུར་སྟི་ལ་བལྟ་བར་མི་བྱ་བ་དང་། ཡུལ་འཁོར་སྐྱོང་བྱང་ཆུབ་སེམས་དཔས་ཁྱིམ་ལ་འདྲིས་པར་བྱ་བ་ལ་བལྟ་བར་མི་བྱ་བ་དང་། ཡུལ་འཁོར་སྐྱོང་བྱང་ཆུབ་སེམས་དཔས་ལུས་དང་སྲོག་ལ་བལྟ་བར་མི་བྱ་བ་སྟེ།
en: What are these four? Rāṣṭrapāla, bodhisattvas should have no concern for living in households. Rāṣṭrapāla, having become renunciants, bodhisattvas should have no concern for gain or honor. Rāṣṭrapāla, bodhisattvas should not be concerned with becoming acquainted with householders. And Rāṣṭrapāla, bodhisattvas should have no concern for their bodies or lives.

source: ཡུལ་འཁོར་སྐྱོང་བྱང་ཆུབ་སེམས་དཔས་ཆོས་བཞི་པོ་དེ་དག་ལ་བལྟ་བར་མི་བྱའོ།
en: Rāṣṭrapāla, for these four things bodhisattvas should have no concern.

source: །སྐྱོན་གྱིས་གཟིངས་པ་མཐའ་ཡས་ལྡན་པའི་ཁྱིམ་སྤངས་རྟག་ཏུ་ནོར་མི་བལྟ།
en: “Having renounced the household with its boundless thicket of faults, they never have any concern for wealth.

source: །ཡོན་ཏན་ལྡན་པ་དེས་པ་དེ་དག་དགོན་པར་དགའ་ཞིང་དབང་པོ་དུལ།
en: These gentle ones, endowed with such qualities, will take delight in the forest, with their senses under control.

source: །དེ་དག་གང་དུའང་བུད་མེད་རྣམས་དང་སྐྱེས་པ་དག་དང་འདྲིས་མི་བྱེད།
en: Wherever they are, they will not draw close to women or men.

source: བསེ་ལྟར་གཅིག་པུར་གནས་ཤིང་བསམ་པ་དྲི་མེད་དག་ལ་དྲི་མ་བྲལ།
en: Like rhinoceroses, they dwell in solitude with a pure, immaculate, stainless intention.

source: །དེ་དག་རྙེད་པ་རྣམས་ཀྱིས་དགའ་བར་མི་འགྱུར་མ་ཐོབ་ཡིད་ཞུམ་མེད།
en: “They do not delight in profit, and do not feel disheartened if they receive nothing.

source: །འདོད་པ་ཆུང་སྟེ་ངན་ངོན་ཙམ་ལ་དགའ་ཞིང་སྒྱུ་དང་ཚུལ་འཆོས་སྤངས།
en: Having few desires, they take pleasure in bare necessities, and they have rejected deceit and hypocrisy.

source: །སེམས་ཅན་དོན་ཕྱིར་བརྩོན་འགྲུས་ཡིད་ལྡན་སྦྱིན་དང་དུལ་ལ་རབ་ཏུ་གནས།
en: Their minds endowed with diligence for the sake of sentient beings, they are steeped in generosity and spiritual discipline.

source: །སངས་རྒྱས་ཡེ་ཤེས་དོན་གཉེར་བསམ་གཏན་བརྩོན་འགྲུས་ཡོན་ཏན་ཕ་རོལ་ཕྱིན།
en: Having perfected meditative absorption, diligence, and qualities, they strive for buddha wisdom.

source: །ལུས་དང་དེ་བཞིན་སྲོག་ལ་མི་ལྟ་སྡུག་པའི་རྩ་ལག་རྣམ་སྤངས་ཏེ།
en: “Having no concern for either body or life, and having abandoned beloved relatives,

source: །བསམ་པ་རྡོ་རྗེ་ལྟ་བུར་རབ་བརྟན་རྟག་ཏུ་བྱང་ཆུབ་ལམ་ལ་སྦྱོར།
en: They steadily practice the path to enlightenment, with intention firm as a diamond.

source: ལུས་ནི་དུམ་བུ་དུམ་བུར་བཅད་ཀྱང་དེ་དག་སེམས་ལ་གཡོ་བ་མེད།
en: Even if their bodies were cut into pieces, their minds would not waver.

source: །ཐམས་ཅད་མཁྱེན་ཉིད་རེ་བ་ཕྱིར་ཞིང་བརྩོན་འགྲུས་ཤིན་ཏུ་བརྟན་འདིར་རྩོམ།
en: Hoping for omniscience, they steadily exert themselves in diligence.

source: །ཡུལ་འཁོར་སྐྱོང་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གདུང་བ་མེད་པར་བྱེད་པའི་ཆོས་ཏེ།
en: “Rāṣṭrapāla, there are four things that cause bodhisattvas to be free from distress.

source: ཡུལ་འཁོར་སྐྱོང་ཚུལ་ཁྲིམས་སྐྱོན་མེད་པ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གདུང་བ་མེད་པར་བྱེད་པའི་ཆོས་དང་། ཡུལ་འཁོར་སྐྱོང་དགོན་པ་ལ་གནས་པ་མི་གཏོང་བ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གདུང་བ་མེད་པར་བྱེད་པའི་ཆོས་དང་། ཡུལ་འཁོར་སྐྱོང་འཕགས་པའི་རིགས་བཞི་དང་འཐུན་པར་བྱེད་པ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གདུང་བ་མེད་པར་བྱེད་པའི་ཆོས་དང་། ཡུལ་འཁོར་སྐྱོང་མང་དུ་ཐོས་པ་ཐོབ་པར་བྱེད་པ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གདུང་བ་མེད་པར་བྱེད་པའི་ཆོས་ཏེ།
en: Rāṣṭrapāla, unimpaired discipline is something that causes bodhisattvas to be free from distress. Rāṣṭrapāla, not giving up life in the forest is something that causes bodhisattvas to be free from distress. Rāṣṭrapāla, following the four noble lineages is something that causes bodhisattvas to be free from distress. And Rāṣṭrapāla, obtaining great erudition is something that causes bodhisattvas to be free from distress.

source: ཡུལ་འཁོར་སྐྱོང་བཞི་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གདུང་བ་མེད་པར་བྱེད་པའི་ཆོས་སོ།
en: Rāṣṭrapāla, these four are things that cause bodhisattvas to be free from distress.

source: །སངས་རྒྱས་ཚུལ་ཁྲིམས་དམ་པ་འདི་ལ་འདོད་བྱེད་ཅིང་།
en: “Inducing desire for this genuine discipline of the buddhas,

source: །ཚུལ་ཁྲིམས་དྲི་མེད་ནོར་བུར་རིན་ཆེན་འདྲ་བ་སྲུང་།
en: Protecting flawless discipline like a precious jewel,

source: །དེ་དག་ང་ནི་ཁྲིམས་ལྡན་ལེགས་སྡོམ་ཡིན་མི་སེམས།
en: They do not think, ‘I am endowed with discipline and well restrained.’

source: །ཚུལ་ཁྲིམས་དེ་ཉིད་ལ་ནི་རྟག་ཏུ་སེམས་ཅན་སྦྱོར།
en: And they always connect living beings to this very discipline.

source: །དེ་དག་སྟོང་པ་དགོན་པར་རྟག་ཏུ་གནས་པར་བྱེད།
en: “Living in desolate forests at all times,

source: །དེ་དག་བདག་གི་འདུ་ཤེས་སྲོག་གི་འདུ་ཤེས་མེད།
en: They have no notion of either a self or a life force.

source: །གཟུགས་ཀུན་རྩྭ་དང་ཤིང་དང་བརྩིག་པ་འདྲ་བར་མཐོང་།
en: Perceiving all forms as being like grass, wood, or stone,

source: །འདི་ལ་སྐྱེས་བུ་བུད་མེད་བདག་གི་མེད་པར་མཐོང་།
en: They see that there are neither attendants, nor wives, nor possessions.

source: །འཕགས་རིགས་བཞི་ལ་དགའ་ཞིང་གཡོ་མེད་ཚུལ་འཆོས་མེད།
en: “They rejoice in the four noble lineages and lack deceit and hypocrisy.

source: །བག་ཡོད་དེ་དག་བསམ་པ་ཐག་པས་རབ་ཏུ་སྦྱོར།
en: Conscientious and resolute in mind, they fully engage in practice.

source: ཐོས་དང་ཡོན་ཏན་རྣམས་ལ་རྟག་ཏུ་བརྩོན་པར་བྱེད།
en: Constantly making effort in erudition and qualities,

source: བདེ་བར་གཤེགས་པའི་ཡོན་ཏན་མཐུ་ཆེན་དོན་དུ་གཉེར།
en: They strive for the great power of the Sugata’s qualities.
